app/Controllers/Admin/JadwalController.php

SELECT *
FROM `jadwal_perkuliahan`
WHERE `id_jadwal` = '15'
---
    public function editJadwal($id){
        $data['activePage'] = 'jadwal';
        $db = \Config\Database::connect();

        $dosen = $db->query("SELECT * FROM tabel_dosen");
        $makul = $db->query("SELECT * FROM mata_kuliah");
        $data['dosen'] = $dosen->getResult();
        $data['makul'] = $makul->getResult();

        $query = $db->table('jadwal_perkuliahan');
        $hasil = $query->getWhere(['id_jadwal' => $id])->getRow();

SELECT *
FROM `jadwal_perkuliahan`
WHERE `id_jadwal` = '15'
---
    public function viewDetail($id){
        $data['activePage'] = 'jadwal';
        $db = \Config\Database::connect();

        $model = $db->query('SELECT p.*, k.*, d.* FROM jadwal_perkuliahan p JOIN mata_kuliah k ON p.kode_mk = k.kode_mk JOIN tabel_dosen d ON p.nip = d.nip');
        $data['jadwal'] = $model->getResult();

        $query = $db->table('jadwal_perkuliahan');
        $hasil = $query->getWhere(['id_jadwal' => $id]);